//
//  Data.swift
//  SwiftUITeachingProject
//
//  Created by Maksim Kruglov on 06.02.2023.
//

import SwiftUI

let data = [
    Post(id: 1, title: "Новости Кино", subtitle: "Сиквел «Гладиатора» Ридли Скотта получил дату премьеры", description: "Фильм студии Paramount выйдет в кинотеатрах 22 ноября 2024 года& Ранее мы писали, что главную роль может исполнить Пол Мескал («Солнце мое») — актер ведет переговоры.", image: Image("2")),
    
    Post(id: 2, title: "Новости IT", subtitle: "Cоздатель гитхаба, Крис Ванстрат, запустил собственное игровое издательство", description: "Один из создателей гитхаба, Крис Ванстрат, запустил собственно игровое издательство Null Games для инди-проектов. Вроде бы - ничего особенного, но в правилах четко сказано, что паблишер не рассматривает игры с лутбоксами и иными азартными механиками.", image: Image("1")),
    
    Post (id: 3, title: "Новости из Пензы", subtitle: "Жители разных районов Пензы услышали громкий хлопок, похожий на взрыв, в домах дрожали окна, хлопали двери, пишет ПензаИнформ.", description: "При этом, в пресс-службе МЧС отчитались: никаких сообщений не поступало, пожарные подразделения в местах дислокации. Очевидцы рассказали изданию, что успели заснять на небе «след от самолёта»: «Я это ВИДЕЛА. Фоткала «красивый красный след от самолета», а оно резко полетело вертикально вверх, след быстро растворялся. Разница между фото секунд 5. Еще секунды через 3 после 2-го фото раздался ТЫДЫЩ, от которого тряслись окна. Переход на сверхзвук это был», сообщила читательница «ПензаИнформ».", image: Image("3")),
    
    Post(id: 4, title: "Новости из Грузии", subtitle: "Сборная Грузии по регби одержала в Тбилиси уверенную победу со счетом 75-12 над командой Германии."
, description: "Всю игру грузинская команда доминировала на поле и добилась заслуженной победы в первом матче сезона.❤️ После игры, Нодар Чеишвили на поле сделал предложение своей возлюбленной и под аплодисменты команды и стадиона она согласилась выйти за него замуж.", image: Image("4"))
    
]
